
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       5 |          1 |           1 |
## Affected resources by action

|  Action  | Resources                                                                         |
|:--------:|:----------------------------------------------------------------------------------|
|    🟢     | `module.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache`                     |
|    🟢     | `module.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache`                 |
|    🟢     | `module.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache`  |
|    🟢     | `module.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access`              |
|    🟢     | `module.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache` |
|    🟢     | `aws_iam_policy.TwinDBTestRunner:`                                                |
|    🟡     | `aws_iam_policy.omnibus`                                                          |
|    🔴     | `aws_s3_bucket.infrahouse-omnibus-cache`                                          |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/3544f190-800b-49bc-b012-a89a63571675/terraform-bin plan -no-color --out=tf.plan
aws_iam_policy.TwinDBTestRunner: Refreshing state... [id=arn:aws:iam::303467602807:policy/TwinDBTestRunner]
aws_ssm_parameter.gh_secrets_namespace: Refreshing state... [id=gh_secrets_namespace]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.administrator-access: Reading...
data.aws_iam_policy.administrator-access: Reading...
aws_s3_bucket.infrahouse-omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
aws_iam_user.twindb_test_runner: Refreshing state... [id=twindb_test_runner]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=1445839605]
data.aws_iam_policy_document.service-network-tester-permissions: Reading...
data.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Reading...
data.aws_iam_policy_document.service-network-tester-permissions: Read complete after 0s [id=565030958]
data.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Read complete after 0s [id=1154989936]
data.aws_iam_policy_document.omnibus-assume: Reading...
aws_iam_policy.service-network-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/service-network-tester-permissions]
data.aws_iam_policy_document.omnibus-assume: Read complete after 0s [id=2101509072]
aws_iam_policy.omnibus: Refreshing state... [id=arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001]
aws_iam_role.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control]
aws_iam_role.omnibus: Refreshing state... [id=omnibus]
aws_iam_access_key.twindb_test_runner: Refreshing state... [id=AKIAUNKAUEN32IWKRSEZ]
data.aws_iam_policy_document.service-network-tester-assume: Reading...
data.aws_iam_policy_document.service-network-tester-assume: Read complete after 0s [id=1585108788]
aws_iam_user_policy_attachment.twindb_test_runner: Refreshing state... [id=twindb_test_runner-20230701180031084700000001]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2687752271]
aws_iam_role.service-network-tester: Refreshing state... [id=service-network-tester]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github]
aws_iam_role_policy_attachment.omnibus: Refreshing state... [id=omnibus-20230729042432323400000002]
aws_iam_role_policy_attachment.service-network-tester: Refreshing state... [id=service-network-tester-20230703194225287600000001]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=3110811832]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin-20230702152748646400000001]
data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control-20230630030803961200000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.omnibus-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "omnibus-permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.omnibus will be updated in-place
  ~ resource "aws_iam_policy" "omnibus" {
        id          = "arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001"
        name        = "omnibus20230729042431999200000001"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::infrahouse-omnibus-cache/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket.infrahouse-omnibus-cache will be destroyed
  # (because aws_s3_bucket.infrahouse-omnibus-cache is not in configuration)
  - resource "aws_s3_bucket" "infrahouse-omnibus-cache" {
      - arn                         = "arn:aws:s3:::infrahouse-omnibus-cache" -> null
      - bucket                      = "infrahouse-omnibus-cache" -> null
      - bucket_domain_name          = "infrahouse-omnibus-cache.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "infrahouse-omnibus-cache.s3.us-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2F56UZL2M1ACD" -> null
      - id                          = "infrahouse-omnibus-cache" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {
          - "created_by" = "infrahouse/aws-control-303467602807"
        } -> null

      - grant {
          - id          = "eb12b644232bddf2be57e9f92f01e0bbe02d5d81bcdc1af7b4f7e2ccbdbd4008" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "public-access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache will be created
  + resource "aws_s3_bucket" "omnibus-cache" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "infrahouse-omnibus-cache"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache will be created
  + resource "aws_s3_bucket_acl" "omnibus-cache" {
      + acl    = "public-read"
      + bucket = "infrahouse-omnibus-cache"
      + id     = (known after apply)
    }

  # module.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache will be created
  + resource "aws_s3_bucket_ownership_controls" "omnibus-cache" {
      + bucket = "infrahouse-omnibus-cache"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access will be created
  + resource "aws_s3_bucket_policy" "public-access" {
      + bucket = "infrahouse-omnibus-cache"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache will be created
  + resource "aws_s3_bucket_public_access_block" "omnibus-cache" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = "infrahouse-omnibus-cache"
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 5 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: aws_iam_policy.TwinDBTestRunner: Refreshing state... [id=arn:aws:iam::303467602807:policy/TwinDBTestRunner]%0Aaws_ssm_parameter.gh_secrets_namespace: Refreshing state... [id=gh_secrets_namespace]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.administrator-access: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Aaws_s3_bucket.infrahouse-omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Aaws_iam_user.twindb_test_runner: Refreshing state... [id=twindb_test_runner]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=1445839605]%0Adata.aws_iam_policy_document.service-network-tester-permissions: Reading...%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Reading...%0Adata.aws_iam_policy_document.service-network-tester-permissions: Read complete after 0s [id=565030958]%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Read complete after 0s [id=1154989936]%0Adata.aws_iam_policy_document.omnibus-assume: Reading...%0Aaws_iam_policy.service-network-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/service-network-tester-permissions]%0Adata.aws_iam_policy_document.omnibus-assume: Read complete after 0s [id=2101509072]%0Aaws_iam_policy.omnibus: Refreshing state... [id=arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001]%0Aaws_iam_role.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control]%0Aaws_iam_role.omnibus: Refreshing state... [id=omnibus]%0Aaws_iam_access_key.twindb_test_runner: Refreshing state... [id=AKIAUNKAUEN32IWKRSEZ]%0Adata.aws_iam_policy_document.service-network-tester-assume: Reading...%0Adata.aws_iam_policy_document.service-network-tester-assume: Read complete after 0s [id=1585108788]%0Aaws_iam_user_policy_attachment.twindb_test_runner: Refreshing state... [id=twindb_test_runner-20230701180031084700000001]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2687752271]%0Aaws_iam_role.service-network-tester: Refreshing state... [id=service-network-tester]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github]%0Aaws_iam_role_policy_attachment.omnibus: Refreshing state... [id=omnibus-20230729042432323400000002]%0Aaws_iam_role_policy_attachment.service-network-tester: Refreshing state... [id=service-network-tester-20230703194225287600000001]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=3110811832]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin-20230702152748646400000001]%0Adata.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control-20230630030803961200000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.aws_iam_policy_document.omnibus-permissions will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "omnibus-permissions" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:DeleteObject",%0A              + "s3:GetObject",%0A              + "s3:ListBucket",%0A              + "s3:PutObject",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A        }%0A    }%0A%0A  # aws_iam_policy.omnibus will be updated in-place%0A  ~ resource "aws_iam_policy" "omnibus" {%0A        id          = "arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001"%0A        name        = "omnibus20230729042431999200000001"%0A      ~ policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = [%0A                          - "s3:PutObject",%0A                          - "s3:ListBucket",%0A                          - "s3:GetObject",%0A                          - "s3:DeleteObject",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:s3:::infrahouse-omnibus-cache/*"%0A                      - Sid      = ""%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A        tags        = {}%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_bucket.infrahouse-omnibus-cache will be destroyed%0A  # (because aws_s3_bucket.infrahouse-omnibus-cache is not in configuration)%0A  - resource "aws_s3_bucket" "infrahouse-omnibus-cache" {%0A      - arn                         = "arn:aws:s3:::infrahouse-omnibus-cache" -> null%0A      - bucket                      = "infrahouse-omnibus-cache" -> null%0A      - bucket_domain_name          = "infrahouse-omnibus-cache.s3.amazonaws.com" -> null%0A      - bucket_regional_domain_name = "infrahouse-omnibus-cache.s3.us-west-1.amazonaws.com" -> null%0A      - force_destroy               = false -> null%0A      - hosted_zone_id              = "Z2F56UZL2M1ACD" -> null%0A      - id                          = "infrahouse-omnibus-cache" -> null%0A      - object_lock_enabled         = false -> null%0A      - region                      = "us-west-1" -> null%0A      - request_payer               = "BucketOwner" -> null%0A      - tags                        = {} -> null%0A      - tags_all                    = {%0A          - "created_by" = "infrahouse/aws-control-303467602807"%0A        } -> null%0A%0A      - grant {%0A          - id          = "eb12b644232bddf2be57e9f92f01e0bbe02d5d81bcdc1af7b4f7e2ccbdbd4008" -> null%0A          - permissions = [%0A              - "FULL_CONTROL",%0A            ] -> null%0A          - type        = "CanonicalUser" -> null%0A        }%0A%0A      - server_side_encryption_configuration {%0A          - rule {%0A              - bucket_key_enabled = false -> null%0A%0A              - apply_server_side_encryption_by_default {%0A                  - sse_algorithm = "AES256" -> null%0A                }%0A            }%0A        }%0A%0A      - versioning {%0A          - enabled    = false -> null%0A          - mfa_delete = false -> null%0A        }%0A    }%0A%0A  # module.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "public-access" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:GetObject",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A%0A          + principals {%0A              + identifiers = [%0A                  + "*",%0A                ]%0A              + type        = "AWS"%0A            }%0A        }%0A    }%0A%0A  # module.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache will be created%0A  + resource "aws_s3_bucket" "omnibus-cache" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "infrahouse-omnibus-cache"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache will be created%0A  + resource "aws_s3_bucket_acl" "omnibus-cache" {%0A      + acl    = "public-read"%0A      + bucket = "infrahouse-omnibus-cache"%0A      + id     = (known after apply)%0A    }%0A%0A  # module.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache will be created%0A  + resource "aws_s3_bucket_ownership_controls" "omnibus-cache" {%0A      + bucket = "infrahouse-omnibus-cache"%0A      + id     = (known after apply)%0A%0A      + rule {%0A          + object_ownership = "BucketOwnerPreferred"%0A        }%0A    }%0A%0A  # module.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access will be created%0A  + resource "aws_s3_bucket_policy" "public-access" {%0A      + bucket = "infrahouse-omnibus-cache"%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # module.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache will be created%0A  + resource "aws_s3_bucket_public_access_block" "omnibus-cache" {%0A      + block_public_acls       = false%0A      + block_public_policy     = false%0A      + bucket                  = "infrahouse-omnibus-cache"%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = false%0A      + restrict_public_buckets = false%0A    }%0A%0APlan: 5 to add, 1 to change, 1 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC8zNTQ0ZjE5MC04MDBiLTQ5YmMtYjAxMi1hODlhNjM1NzE2NzUvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5hd3NfaWFtX3BvbGljeS5Ud2luREJUZXN0UnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9Ud2luREJUZXN0UnVubmVyXVxuYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdoX3NlY3JldHNfbmFtZXNwYWNlXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5hd3NfczNfYnVja2V0LmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXVxubW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbmF3c19pYW1fdXNlci50d2luZGJfdGVzdF9ydW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXR3aW5kYl90ZXN0X3J1bm5lcl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE0NDU4Mzk2MDVdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtaWgtY2ljZC1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD01NjUwMzA5NThdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWloLWNpY2QtY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTQ5ODk5MzZdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtYXNzdW1lOiBSZWFkaW5nLi4uXG5hd3NfaWFtX3BvbGljeS5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjEwMTUwOTA3Ml1cbmF3c19pYW1fcG9saWN5Lm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L29tbmlidXMyMDIzMDcyOTA0MjQzMTk5OTIwMDAwMDAwMV1cbmF3c19pYW1fcm9sZS5paC10Zi1jaWNkLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWNpY2QtY29udHJvbF1cbmF3c19pYW1fcm9sZS5vbW5pYnVzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1vbW5pYnVzXVxuYXdzX2lhbV9hY2Nlc3Nfa2V5LnR3aW5kYl90ZXN0X3J1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QUtJQVVOS0FVRU4zMklXS1JTRVpdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTg1MTA4Nzg4XVxuYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50LnR3aW5kYl90ZXN0X3J1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dHdpbmRiX3Rlc3RfcnVubmVyLTIwMjMwNzAxMTgwMDMxMDg0NzAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNjg3NzUyMjcxXVxuYXdzX2lhbV9yb2xlLnNlcnZpY2UtbmV0d29yay10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1naXRodWJdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQub21uaWJ1czogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9b21uaWJ1cy0yMDIzMDcyOTA0MjQzMjMyMzQwMDAwMDAwMl1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLTIwMjMwNzAzMTk0MjI1Mjg3NjAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzExMDgxMTgzMl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW5dXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLTIwMjMwNzAyMTUyNzQ4NjQ2NDAwMDAwMDAxXVxuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1jaWNkLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWNpY2QtY29udHJvbC0yMDIzMDYzMDAzMDgwMzk2MTIwMDAwMDAwMV1cblxuVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICArIGNyZWF0ZVxuICB+IHVwZGF0ZSBpbi1wbGFjZVxuICAtIGRlc3Ryb3lcbiA8PSByZWFkIChkYXRhIHJlc291cmNlcylcblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cbiAgIyBkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtcGVybWlzc2lvbnMgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseVxuICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKVxuIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwib21uaWJ1cy1wZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsganNvbiA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwiczM6RGVsZXRlT2JqZWN0XCIsXG4gICAgICAgICAgICAgICsgXCJzMzpHZXRPYmplY3RcIixcbiAgICAgICAgICAgICAgKyBcInMzOkxpc3RCdWNrZXRcIixcbiAgICAgICAgICAgICAgKyBcInMzOlB1dE9iamVjdFwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgcmVzb3VyY2VzID0gW1xuICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksXG4gICAgICAgICAgICBdXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBhd3NfaWFtX3BvbGljeS5vbW5pYnVzIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcIm9tbmlidXNcIiB7XG4gICAgICAgIGlkICAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9vbW5pYnVzMjAyMzA3MjkwNDI0MzE5OTkyMDAwMDAwMDFcIlxuICAgICAgICBuYW1lICAgICAgICA9IFwib21uaWJ1czIwMjMwNzI5MDQyNDMxOTk5MjAwMDAwMDAxXCJcbiAgICAgIH4gcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAtIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgIC0ge1xuICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzMzpQdXRPYmplY3RcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInMzOkxpc3RCdWNrZXRcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInMzOkdldE9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6RGVsZXRlT2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUvKlwiXG4gICAgICAgICAgICAgICAgICAgICAgLSBTaWQgICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgIC0gVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgKSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgIHRhZ3MgICAgICAgID0ge31cbiAgICAgICAgIyAoNSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgYXdzX3MzX2J1Y2tldC5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUgd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBhd3NfczNfYnVja2V0LmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZSBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcbiAgLSByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcImluZnJhaG91c2Utb21uaWJ1cy1jYWNoZVwiIHtcbiAgICAgIC0gYXJuICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXCIgLT4gbnVsbFxuICAgICAgLSBidWNrZXQgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2Utb21uaWJ1cy1jYWNoZVwiIC0+IG51bGxcbiAgICAgIC0gYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgID0gXCJpbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuczMuYW1hem9uYXdzLmNvbVwiIC0+IG51bGxcbiAgICAgIC0gYnVja2V0X3JlZ2lvbmFsX2RvbWFpbl9uYW1lID0gXCJpbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuczMudXMtd2VzdC0xLmFtYXpvbmF3cy5jb21cIiAtPiBudWxsXG4gICAgICAtIGZvcmNlX2Rlc3Ryb3kgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgID0gXCJaMkY1NlVaTDJNMUFDRFwiIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVcIiAtPiBudWxsXG4gICAgICAtIG9iamVjdF9sb2NrX2VuYWJsZWQgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gcmVnaW9uICAgICAgICAgICAgICAgICAgICAgID0gXCJ1cy13ZXN0LTFcIiAtPiBudWxsXG4gICAgICAtIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICA9IFwiQnVja2V0T3duZXJcIiAtPiBudWxsXG4gICAgICAtIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgIC0gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJcbiAgICAgICAgfSAtPiBudWxsXG5cbiAgICAgIC0gZ3JhbnQge1xuICAgICAgICAgIC0gaWQgICAgICAgICAgPSBcImViMTJiNjQ0MjMyYmRkZjJiZTU3ZTlmOTJmMDFlMGJiZTAyZDVkODFiY2RjMWFmN2I0ZjdlMmNjYmRiZDQwMDhcIiAtPiBudWxsXG4gICAgICAgICAgLSBwZXJtaXNzaW9ucyA9IFtcbiAgICAgICAgICAgICAgLSBcIkZVTExfQ09OVFJPTFwiLFxuICAgICAgICAgICAgXSAtPiBudWxsXG4gICAgICAgICAgLSB0eXBlICAgICAgICA9IFwiQ2Fub25pY2FsVXNlclwiIC0+IG51bGxcbiAgICAgICAgfVxuXG4gICAgICAtIHNlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbiB7XG4gICAgICAgICAgLSBydWxlIHtcbiAgICAgICAgICAgICAgLSBidWNrZXRfa2V5X2VuYWJsZWQgPSBmYWxzZSAtPiBudWxsXG5cbiAgICAgICAgICAgICAgLSBhcHBseV9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2J5X2RlZmF1bHQge1xuICAgICAgICAgICAgICAgICAgLSBzc2VfYWxnb3JpdGhtID0gXCJBRVMyNTZcIiAtPiBudWxsXG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfVxuICAgICAgICB9XG5cbiAgICAgIC0gdmVyc2lvbmluZyB7XG4gICAgICAgICAgLSBlbmFibGVkICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgICAgIC0gbWZhX2RlbGV0ZSA9IGZhbHNlIC0+IG51bGxcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdWJsaWMtYWNjZXNzIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHlcbiAgIyAoY29uZmlnIHJlZmVycyB0byB2YWx1ZXMgbm90IHlldCBrbm93bilcbiA8PSBkYXRhIFwiYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnRcIiBcInB1YmxpYy1hY2Nlc3NcIiB7XG4gICAgICArIGlkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgc3RhdGVtZW50IHtcbiAgICAgICAgICArIGFjdGlvbnMgICA9IFtcbiAgICAgICAgICAgICAgKyBcInMzOkdldE9iamVjdFwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgcmVzb3VyY2VzID0gW1xuICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksXG4gICAgICAgICAgICBdXG5cbiAgICAgICAgICArIHByaW5jaXBhbHMge1xuICAgICAgICAgICAgICArIGlkZW50aWZpZXJzID0gW1xuICAgICAgICAgICAgICAgICAgKyBcIipcIixcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgdHlwZSAgICAgICAgPSBcIkFXU1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXQub21uaWJ1cy1jYWNoZSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcIm9tbmlidXMtY2FjaGVcIiB7XG4gICAgICArIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXCJcbiAgICAgICsgYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZm9yY2VfZGVzdHJveSAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG9iamVjdF9sb2NrX2VuYWJsZWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJcbiAgICAgICAgfVxuICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfYWNsLm9tbmlidXMtY2FjaGUgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0X2FjbFwiIFwib21uaWJ1cy1jYWNoZVwiIHtcbiAgICAgICsgYWNsICAgID0gXCJwdWJsaWMtcmVhZFwiXG4gICAgICArIGJ1Y2tldCA9IFwiaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXCJcbiAgICAgICsgaWQgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9vd25lcnNoaXBfY29udHJvbHMub21uaWJ1cy1jYWNoZSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzXCIgXCJvbW5pYnVzLWNhY2hlXCIge1xuICAgICAgKyBidWNrZXQgPSBcImluZnJhaG91c2Utb21uaWJ1cy1jYWNoZVwiXG4gICAgICArIGlkICAgICA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBydWxlIHtcbiAgICAgICAgICArIG9iamVjdF9vd25lcnNoaXAgPSBcIkJ1Y2tldE93bmVyUHJlZmVycmVkXCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9wb2xpY3kucHVibGljLWFjY2VzcyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfcG9saWN5XCIgXCJwdWJsaWMtYWNjZXNzXCIge1xuICAgICAgKyBidWNrZXQgPSBcImluZnJhaG91c2Utb21uaWJ1cy1jYWNoZVwiXG4gICAgICArIGlkICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLm9tbmlidXMtY2FjaGUgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2tcIiBcIm9tbmlidXMtY2FjaGVcIiB7XG4gICAgICArIGJsb2NrX3B1YmxpY19hY2xzICAgICAgID0gZmFsc2VcbiAgICAgICsgYmxvY2tfcHVibGljX3BvbGljeSAgICAgPSBmYWxzZVxuICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXCJcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlnbm9yZV9wdWJsaWNfYWNscyAgICAgID0gZmFsc2VcbiAgICAgICsgcmVzdHJpY3RfcHVibGljX2J1Y2tldHMgPSBmYWxzZVxuICAgIH1cblxuUGxhbjogNSB0byBhZGQsIDEgdG8gY2hhbmdlLCAxIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcblJlbGVhc2luZyBzdGF0ZSBsb2NrLiBUaGlzIG1heSB0YWtlIGEgZmV3IG1vbWVudHMuLi5cbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IGF3c19pYW1fcG9saWN5LlR3aW5EQlRlc3RSdW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L1R3aW5EQlRlc3RSdW5uZXJdJTBBYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdoX3NlY3JldHNfbmFtZXNwYWNlXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFhd3NfczNfYnVja2V0LmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXSUwQW1vZHVsZS5naXRodWItY29ubmVjdG9yLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBYXdzX2lhbV91c2VyLnR3aW5kYl90ZXN0X3J1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dHdpbmRiX3Rlc3RfcnVubmVyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNDQ1ODM5NjA1XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtaWgtY2ljZC1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NTY1MDMwOTU4XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtaWgtY2ljZC1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTE1NDk4OTkzNl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtYXNzdW1lOiBSZWFkaW5nLi4uJTBBYXdzX2lhbV9wb2xpY3kuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uc10lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMTAxNTA5MDcyXSUwQWF3c19pYW1fcG9saWN5Lm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L29tbmlidXMyMDIzMDcyOTA0MjQzMTk5OTIwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGUuaWgtdGYtY2ljZC1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1jaWNkLWNvbnRyb2xdJTBBYXdzX2lhbV9yb2xlLm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW9tbmlidXNdJTBBYXdzX2lhbV9hY2Nlc3Nfa2V5LnR3aW5kYl90ZXN0X3J1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QUtJQVVOS0FVRU4zMklXS1JTRVpdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1ODUxMDg3ODhdJTBBYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50LnR3aW5kYl90ZXN0X3J1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dHdpbmRiX3Rlc3RfcnVubmVyLTIwMjMwNzAxMTgwMDMxMDg0NzAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI2ODc3NTIyNzFdJTBBYXdzX2lhbV9yb2xlLnNlcnZpY2UtbmV0d29yay10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5vbW5pYnVzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1vbW5pYnVzLTIwMjMwNzI5MDQyNDMyMzIzNDAwMDAwMDAyXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLTIwMjMwNzAzMTk0MjI1Mjg3NjAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMTEwODExODMyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW5dJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4tMjAyMzA3MDIxNTI3NDg2NDY0MDAwMDAwMDFdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtY2ljZC1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1jaWNkLWNvbnRyb2wtMjAyMzA2MzAwMzA4MDM5NjEyMDAwMDAwMDFdJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgICsgY3JlYXRlJTBBICB+IHVwZGF0ZSBpbi1wbGFjZSUwQSAgLSBkZXN0cm95JTBBIDw9IHJlYWQgKGRhdGEgcmVzb3VyY2VzKSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtcGVybWlzc2lvbnMgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseSUwQSAgIyAoY29uZmlnIHJlZmVycyB0byB2YWx1ZXMgbm90IHlldCBrbm93biklMEEgPD0gZGF0YSBcImF3c19pYW1fcG9saWN5X2RvY3VtZW50XCIgXCJvbW5pYnVzLXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBzdGF0ZW1lbnQgeyUwQSAgICAgICAgICArIGFjdGlvbnMgICA9IFslMEEgICAgICAgICAgICAgICsgXCJzMzpEZWxldGVPYmplY3RcIiwlMEEgICAgICAgICAgICAgICsgXCJzMzpHZXRPYmplY3RcIiwlMEEgICAgICAgICAgICAgICsgXCJzMzpMaXN0QnVja2V0XCIsJTBBICAgICAgICAgICAgICArIFwiczM6UHV0T2JqZWN0XCIsJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgICArIHJlc291cmNlcyA9IFslMEEgICAgICAgICAgICAgICsgKGtub3duIGFmdGVyIGFwcGx5KSwlMEEgICAgICAgICAgICBdJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgYXdzX2lhbV9wb2xpY3kub21uaWJ1cyB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwib21uaWJ1c1wiIHslMEEgICAgICAgIGlkICAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9vbW5pYnVzMjAyMzA3MjkwNDI0MzE5OTkyMDAwMDAwMDFcIiUwQSAgICAgICAgbmFtZSAgICAgICAgPSBcIm9tbmlidXMyMDIzMDcyOTA0MjQzMTk5OTIwMDAwMDAwMVwiJTBBICAgICAgfiBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgLSBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgLSB7JTBBICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6UHV0T2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6TGlzdEJ1Y2tldFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInMzOkdldE9iamVjdFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInMzOkRlbGV0ZU9iamVjdFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLypcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgLSBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICkgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgdGFncyAgICAgICAgPSB7fSUwQSAgICAgICAgIyAoNSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgYXdzX3MzX2J1Y2tldC5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUgd2lsbCBiZSBkZXN0cm95ZWQlMEEgICMgKGJlY2F1c2UgYXdzX3MzX2J1Y2tldC5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pJTBBICAtIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwiaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXCIgeyUwQSAgICAgIC0gYXJuICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXCIgLT4gbnVsbCUwQSAgICAgIC0gYnVja2V0ICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVcIiAtPiBudWxsJTBBICAgICAgLSBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgPSBcImluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5zMy5hbWF6b25hd3MuY29tXCIgLT4gbnVsbCUwQSAgICAgIC0gYnVja2V0X3JlZ2lvbmFsX2RvbWFpbl9uYW1lID0gXCJpbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuczMudXMtd2VzdC0xLmFtYXpvbmF3cy5jb21cIiAtPiBudWxsJTBBICAgICAgLSBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsJTBBICAgICAgLSBob3N0ZWRfem9uZV9pZCAgICAgICAgICAgICAgPSBcIloyRjU2VVpMMk0xQUNEXCIgLT4gbnVsbCUwQSAgICAgIC0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVcIiAtPiBudWxsJTBBICAgICAgLSBvYmplY3RfbG9ja19lbmFibGVkICAgICAgICAgPSBmYWxzZSAtPiBudWxsJTBBICAgICAgLSByZWdpb24gICAgICAgICAgICAgICAgICAgICAgPSBcInVzLXdlc3QtMVwiIC0+IG51bGwlMEEgICAgICAtIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICA9IFwiQnVja2V0T3duZXJcIiAtPiBudWxsJTBBICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7fSAtPiBudWxsJTBBICAgICAgLSB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCIlMEEgICAgICAgIH0gLT4gbnVsbCUwQSUwQSAgICAgIC0gZ3JhbnQgeyUwQSAgICAgICAgICAtIGlkICAgICAgICAgID0gXCJlYjEyYjY0NDIzMmJkZGYyYmU1N2U5ZjkyZjAxZTBiYmUwMmQ1ZDgxYmNkYzFhZjdiNGY3ZTJjY2JkYmQ0MDA4XCIgLT4gbnVsbCUwQSAgICAgICAgICAtIHBlcm1pc3Npb25zID0gWyUwQSAgICAgICAgICAgICAgLSBcIkZVTExfQ09OVFJPTFwiLCUwQSAgICAgICAgICAgIF0gLT4gbnVsbCUwQSAgICAgICAgICAtIHR5cGUgICAgICAgID0gXCJDYW5vbmljYWxVc2VyXCIgLT4gbnVsbCUwQSAgICAgICAgfSUwQSUwQSAgICAgIC0gc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uIHslMEEgICAgICAgICAgLSBydWxlIHslMEEgICAgICAgICAgICAgIC0gYnVja2V0X2tleV9lbmFibGVkID0gZmFsc2UgLT4gbnVsbCUwQSUwQSAgICAgICAgICAgICAgLSBhcHBseV9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2J5X2RlZmF1bHQgeyUwQSAgICAgICAgICAgICAgICAgIC0gc3NlX2FsZ29yaXRobSA9IFwiQUVTMjU2XCIgLT4gbnVsbCUwQSAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgfSUwQSAgICAgICAgfSUwQSUwQSAgICAgIC0gdmVyc2lvbmluZyB7JTBBICAgICAgICAgIC0gZW5hYmxlZCAgICA9IGZhbHNlIC0+IG51bGwlMEEgICAgICAgICAgLSBtZmFfZGVsZXRlID0gZmFsc2UgLT4gbnVsbCUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdWJsaWMtYWNjZXNzIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pJTBBIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwicHVibGljLWFjY2Vzc1wiIHslMEEgICAgICArIGlkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBqc29uID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgc3RhdGVtZW50IHslMEEgICAgICAgICAgKyBhY3Rpb25zICAgPSBbJTBBICAgICAgICAgICAgICArIFwiczM6R2V0T2JqZWN0XCIsJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgICArIHJlc291cmNlcyA9IFslMEEgICAgICAgICAgICAgICsgKGtub3duIGFmdGVyIGFwcGx5KSwlMEEgICAgICAgICAgICBdJTBBJTBBICAgICAgICAgICsgcHJpbmNpcGFscyB7JTBBICAgICAgICAgICAgICArIGlkZW50aWZpZXJzID0gWyUwQSAgICAgICAgICAgICAgICAgICsgXCIqXCIsJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgdHlwZSAgICAgICAgPSBcIkFXU1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldC5vbW5pYnVzLWNhY2hlIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcIm9tbmlidXMtY2FjaGVcIiB7JTBBICAgICAgKyBhY2NlbGVyYXRpb25fc3RhdHVzICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhY2wgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2Utb21uaWJ1cy1jYWNoZVwiJTBBICAgICAgKyBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVnaW9uICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVxdWVzdF9wYXllciAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICB9JTBBICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB3ZWJzaXRlX2VuZHBvaW50ICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X2FjbC5vbW5pYnVzLWNhY2hlIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfYWNsXCIgXCJvbW5pYnVzLWNhY2hlXCIgeyUwQSAgICAgICsgYWNsICAgID0gXCJwdWJsaWMtcmVhZFwiJTBBICAgICAgKyBidWNrZXQgPSBcImluZnJhaG91c2Utb21uaWJ1cy1jYWNoZVwiJTBBICAgICAgKyBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5vbW5pYnVzLWNhY2hlIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzXCIgXCJvbW5pYnVzLWNhY2hlXCIgeyUwQSAgICAgICsgYnVja2V0ID0gXCJpbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVcIiUwQSAgICAgICsgaWQgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgcnVsZSB7JTBBICAgICAgICAgICsgb2JqZWN0X293bmVyc2hpcCA9IFwiQnVja2V0T3duZXJQcmVmZXJyZWRcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9wb2xpY3kucHVibGljLWFjY2VzcyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0X3BvbGljeVwiIFwicHVibGljLWFjY2Vzc1wiIHslMEEgICAgICArIGJ1Y2tldCA9IFwiaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXCIlMEEgICAgICArIGlkICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5vbW5pYnVzLWNhY2hlIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9ja1wiIFwib21uaWJ1cy1jYWNoZVwiIHslMEEgICAgICArIGJsb2NrX3B1YmxpY19hY2xzICAgICAgID0gZmFsc2UlMEEgICAgICArIGJsb2NrX3B1YmxpY19wb2xpY3kgICAgID0gZmFsc2UlMEEgICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVcIiUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZ25vcmVfcHVibGljX2FjbHMgICAgICA9IGZhbHNlJTBBICAgICAgKyByZXN0cmljdF9wdWJsaWNfYnVja2V0cyA9IGZhbHNlJTBBICAgIH0lMEElMEFQbGFuOiA1IHRvIGFkZCwgMSB0byBjaGFuZ2UsIDEgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFSZWxlYXNpbmcgc3RhdGUgbG9jay4gVGhpcyBtYXkgdGFrZSBhIGZldyBtb21lbnRzLi4uJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDUsICJjaGFuZ2UiOiAxLCAiZGVzdHJveSI6IDF9fQ==```
</p></details>